var map = L.map('map').setView([13.539973, 100.620207], 17);

L.tileLayer(
  'https://server.arcgisonline.com/ArcGIS/rest/services/World_Imagery/MapServer/tile/{z}/{y}/{x}',
  { attribution: '© Esri' }
).addTo(map);

var buildings = [
  {
    name: "อาคาร 1",
    lat: 13.539755,
    lng: 100.620095,
    images: ["images/building1.jpg","images/building4.png"],
    detail: "อาคารอำนวยการ"
  },
  {
    name: "อาคาร 2",
    lat: 13.540015,
    lng: 100.619764,
    images: ["images/building2.jpg", "images/building3.png"],
    detail: "อาคารคณะการตลาด/ห้องงานทะเบียน"
  },
  {
    name: "อาคาร 3",
    lat: 13.539242,
    lng: 100.619722,
    images: ["images/building5.png"],
    detail: "อาคารภาษาไทย/สังคม/ห้องวัดผล"
  },
  {
    name: "ห้องสมุด",
    lat: 13.53926,
    lng: 100.619964,
    images: ["images/building6.png"],
    detail: "ห้องสมุด"
  },
  {
    name: "โรงอาหาร",
    lat: 13.538444,
    lng: 100.619906, 
    images: ["images/building7.png"],
    detail: "โรงอาหาร1"
  },
   {
    name: "อาคาร 9",
    lat: 13.539474,
    lng: 100.619232, 
    images: ["images/building8.png"],
    detail: "อาคารคณะโลจิสติกส์/ห้องประชุมใหญ่"
  },
  {
    name: "อาคารศิลปกรรม",
    lat: 13.539123,
    lng: 100.619250, 
    images: ["images/building9.png"],
    detail: "อาคารคณะศิลปกรรม/คอมพิวเตอร์กราฟฟิค"
  },
  {
    name: "แผนกช่างยนต์",
    lat: 13.53875,
    lng: 100.618725,
    images: ["images/building10.png",],
    detail: "อาคารคณะช่างยนต์"
  },
  {
    name: "แผนกช่างเชื่อมโลหะ",
    lat: 13.538613,
    lng: 100.61928,
    images: ["images/building11.png",],
    detail: "อาคารคณะช่างเชื่อมโลหะ"
  },
   {
    name: "แผนกช่างก่อสร้าง",
    lat: 13.538787,
    lng: 100.61833,
    images: ["images/building12.png",],
    detail: "อาคารคณะช่างก่อสร้าง"
  },
  {
    name: "แผนกแฟชั่นและสิ่งทอ/อุตสาหกรรมการท่องเที่ยว/การโรงแรม",
    lat: 13.538315,
    lng: 100.619144,
    images: ["images/building13.png","images/building14.png","images/building15.png",],
    detail: "อาคารคณะแฟชั่นและสิ่งทอ/อุตสาหกรรมการท่องเที่ยว/การโรงแรม"
  },
  {
    name: "แผนกอาหารและโภชนาการ",
    lat: 13.537973,
    lng: 100.619485,
    images: ["images/building16.png",],
    detail: "อาคารคณะอาหารและโภชนาการ"
  },
   {
    name: "งานสวัสดิการนักเรียนนักศึกษา",
    lat: 13.537973,
    lng: 100.619173,
    images: ["images/building17.png",],
    detail: "งานสวัสดิการนักเรียนนักศึกษา"
  },
  {
    name: "งานพัสดุ",
    lat: 13.538265,
    lng: 100.61947,
    images: ["images/building18.png",],
    detail: "งานพัสดุ"
  },
  {
    name: "โรงอาหาร 2",
    lat: 13.537643,
    lng: 100.617555,
    images: ["images/building19.png",],
    detail: "โรงอาหาร 2"
  },
  {
    name: "แผนกวิชาช่างอากาศยาน",
    lat: 13.537555,
    lng: 100.617777,
    images: ["images/building20.png",],
    detail: "แผนกวิชาช่างอากาศยาน"
  },
  {
    name: "แผนกเทคโนโลยีสารสนเทศ/แผนกช่างเทคนิคอุตสาหกรรม",
    lat: 13.537387,
    lng: 100.617725,
    images: ["images/building21.png","images/building22.png",],
    detail: "แผนกเทคโนโลยีสารสนเทศ/แผนกช่างเทคนิคอุตสาหกรรม"
  },
  {
    name: "สาขางานออกแบบและเขียนแบบการผลิต/สาขางานเขียนแบบเครื่องกล",
    lat: 13.538126,
    lng: 100.618847,
    images: ["images/building23.png",],
    detail: "สาขางานออกแบบและเขียนแบบการผลิต/สาขางานเขียนแบบเครื่องกล"
  },
  {
    name: "แผนกช่างเชื่อมและโลหะแผ่น",
    lat: 13.538351,
    lng: 100.619057,
    images: ["images/building24.png",],
    detail: "แผนกช่างเชื่อมและโลหะแผ่น"
  },
   {
    name: "คณะวิชาเครื่องกลและยานยนต์",
    lat: 13.538043,
    lng: 100.618847,
    images: ["images/building25.png",],
    detail: "คณะวิชาเครื่องกลและยานยนต์"
  },
   {
    name: "แผนกช่างก่อสร้าง",
    lat: 13.538363,
    lng: 100.618279,
    images: ["images/building26.png",],
    detail: "แผนกช่างก่อสร้าง"
  },
  {
    name: "แผนกแม่พิมพ์โลหะ",
    lat: 13.537819,
    lng: 100.618723,
    images: ["images/building27.png",],
    detail: "แผนกแม่พิมพ์โลหะ"
  },
  {
    name: "แผนกอิเล็กทรอนิกส์",
    lat: 13.537517,
    lng: 100.618267,
    images: ["images/building28.png",],
    detail: "แผนกอิเล็กทรอนิกส์"
  },
   {
    name: "สนามกีฬา/ลานจอดเครื่องบิน",
    lat: 13.537977,
    lng: 100.617868,
    images: ["images/building29.png",],
    detail: "สนามกีฬา/ลานจอดเครื่องบิน"
  },
  {
    name: "แผนกวิชาแม่พิมพ์พลาสติก",
    lat: 13.537458,
    lng: 100.618655,
    images: ["images/building30.png",],
    detail: "แผนกวิชาแม่พิมพ์พลาสติก"
  },
];

buildings.forEach(b => {
  let imagesHtml = '';
  if (b.images && Array.isArray(b.images)) {
    imagesHtml = b.images.map(img => `<img src="${img}" style="width:200px;margin-bottom:5px;"><br>`).join('');
  } else if (b.image) {
    imagesHtml = `<img src="${b.image}" style="width:200px"><br>`;
  }
  L.marker([b.lat, b.lng])
    .addTo(map)
    .bindPopup(`
      <b>${b.name}</b><br>
      ${imagesHtml}
      <small>${b.detail}</small><br>
      <a href="https://www.google.com/maps/dir/?api=1&destination=${b.lat},${b.lng}" target="_blank" style="color:blue;text-decoration:underline;">
        🧭 นำทาง
      </a>
    `);
});
const thumbnail = document.getElementById("thumbnail-container");

thumbnail.addEventListener("click", () => {
  thumbnail.classList.toggle("expanded");
});
